/*公共字段以外格式：*/
/*页面滚动操作,以固定时间间隔持续打点记录*/
data=  {
    // 页面滚动
    {
        type: "scroll",
        t: 1426055121424,   // 时间，13位，毫秒
        offsetX: 0          // 偏移量
        offsetY: 600        // 偏移量
    },
     
    // 浏览器缩放 
    {
        type: "resize",
        t: 1425349269304,   // 时间，13位，毫秒
        width: 1663,        // 浏览器宽度
        height: 651         // 浏览器高度
    },
        
    // 结果进入可视区域    
    {
        type: "sight",
        resid: "L1",       // L代表左侧结果;R代表右侧结果;T代表顶部通栏结果。后面的数字是结果的排序。
        action: "in",
        t: 1425350067291
    },
     
    // 结果离开可视区域   
    {
        type: "sight",
        resid: "L1",
        action: "out",
        t: 1425350075094
    },
     
    // 鼠标进入结果
    {
        type: "mouseIn",
        resid: "L1", 
        t: 1425350067291
    },
     
    // 鼠标离开结果  
    {
        type: "mouseOut",
        resid: "L1",
        t: 1425350075094
    },
     
    // 页面失去焦点(最小化或切换tab)
    {
        type: "blur",
        t: 1426055121424
    },
     
    // 页面重新获取焦点   
    {
        type: "focus",
        t: 1426055121994
    }
}